{
	"hola.title": " Hallo!",
	"edu.aca1.text1": "Master in Branded Content und Transmedienkommunikation",
	"edu.aca1.text2": "Universität Carlos III. Madrid. 2015",
	"edu.aca2.text1": "Master in Integriertem Werbemanagement der TWBA.",
	"edu.aca2.text2": "Antonio-Nebrija-Universität. Madrid. 2014",
	"edu.aca3.text1": "Hochschulabschluss in Werbung.",
	"edu.aca3.text2": "UNAPEC. Dominikanische Republik, Santo Domingo. 2012",
	"edu.acatitle": "Akademische Ausbildung",
	"edu.comp1": "Angular: Von Null bis zum Experten, der Anwendungen erstellt (Angular 10+) Udemy Online.",
	"edu.comp2": "Web-Entwicklung Bootcamp Full Stack. 1000 h Factoria F5. Madrid. 2019-2020",
	"edu.comptitle": "Ergänzende Ausbildung",
	"edu.eduexp": "Ausbildung",
	"info.contact": " Kontaktinformationen",
	"info.detail": "Dies sind die Möglichkeiten, mich zu kontaktieren.",
	"info.detail1": "Profil auf GitHub",
	"info.detail2": "Profil auf LinkedIn",
	"intro.contact": "Kontakt",
	"intro.ctitle": "Webentwickler | Werbetreibender",
	"intro.description.text1": " Mein Name ist Ernesto Silva Languasco. Ich studierte Werbung als Universitätskarriere mit Schwerpunkt auf Inhaltserstellung und Marketingstrategie.",
	"intro.description.text2": " Ich bin vor einiger Zeit in die Welt der Web-Programmierung eingestiegen, da ich mich schon immer für Technologie und Kommunikation interessiert habe. Das Ergebnis ist diese Seite. Ich strebe an, ein Full Stack-Programmierer zu sein, da es ein guter Ausgleich ist, als Profi einen guten Service bieten zu können und sowohl das Front-End als auch das Back-End zu beherrschen. Dadurch wird sichergestellt, dass bei der Arbeit an einem neuen Projekt die beste Design-, Entwicklungs- und Verbreitungsstrategie unter Berücksichtigung der Instrumente angewandt wird.",
	"intro.home": "Startseite",
	"intro.portfolio": "Geschäftsbereich",
	"intro.subctitle": "Ein Werbefachmann, der in die Webentwicklung einsteigt und immer nach unten scrollt oder Seiten nach links blättert.",
	"job.jobexp": "Berufserfahrung",
	"lan.lan1": "Englisch: C1",
	"lan.lan2": "Deutsch: A2",
	"lan.lan3": "Spanisch: Muttersprache",
	"lan.ltitle": "Sprachen",
	"recent1.jobdes": "Vollzeit-Praktikant, der auf der derzeitigen Parkplattform sowohl im Front- als auch im Backend arbeitet",
	"recent2.jobdes.text1": "-Koordination eines Teams von drei Personen in den Abteilungen Marketing und Wartung",
	"recent2.jobdes.text2": "-Kontakt mit Immobilienverwaltungsplattformen, Kundenkontakt, Platzierung von Immobilien in digitalen Medien, kollaborative Coworking-Strategien, Teamkoordination, Grafikdesign, Optimierung des Immobilienzustands, Notfallmanagement, Kontakt mit Auftragnehmern für Verbesserungen.",
	"recent3.jobdes": "Schaffung von Kunst für die verschiedenen Bars und Restaurants, die das Unternehmen besitzt.",
	"recent4.jobdes.text1": "-Inhaltserstellung, SEO und SEM auf Unternehmenswebsites.",
	"recent4.jobdes.text2": "-Inhaltserstellung, SEO und SEM auf Unternehmenswebsites.",
	"tec.tecexp": "Technische Fähigkeiten",
	"work.port": "Hier können Sie die Projekte durchsuchen, mit denen ich gearbeitet habe. Sie werden in ihrer Originalsprache veröffentlicht."
}