{
    "hola.title": " Hallo!",
    "Unethical.intro": "In diesem Abschnitt meines Portfolios werde ich die meisten der Tests veröffentlichen, die ich während des Einstellungsverfahrens verlangt habe. Das Ziel ist es, zu zeigen, wie ich einen Test mit der Zeit löse, in der ich diejenigen, die für den Test arbeiten, hochladen werde, und den Code für jeden, der verstehen möchte, wie er funktioniert, zu erklären. Greifen Sie ruhig zu und verwenden Sie es für alle Jobtests, die den Thesen hier ähnlich sind.",
    "apig.text1": "Eine grundlegende API mit der Get-Methode auf NodeJs, ExpressJS und Moongose (MongoDB)",
    "apig.text10": "Für deployment verwenden wir Heroku und mit den folgenden",
    "apig.text10a": "Leitfaden",
    "apig.text10b": ", Es ist nur das Hinzufügen der Config Vars MONGOD_URI und unseres deb-Links aus Mongo, und das ist im Grunde alles, was wir die Jason-Informationen auf /list sehen können. Wir können diese URL bei jeder Verbindung hinzufügen und wir können die Informationen sehen, als Extra können Sie sehen, dass die CRUD-Methoden enthalten sind, die Sie mit Postman testen können.",
    "apig.text2": "So.... I wurde gebeten, eine einfache API Get zu erstellen, um Informationen von einem Tupfer als Nosql in diesem Fall MongoDB anzuzeigen.",
    "apig.text3": "Wir müssen Nodejs (falls Sie es nicht haben), expressJS, body parse, mongoose und dotenv installieren, letzteres dient dazu, einen einfachen Einsatz zu ermöglichen.",
    "apig.text4": "Zuerst schnüren wir ein Paket. Json dann erstellen wir eine Datei namens app. Js, der Name kann sich ändern, es spielt keine Rolle.",
    "apig.text5": "Jetzt erstellen wir unsere Datenbankdatei, nennen wir sie db. js",
    "apig.text6": "Lässt das Dokument erstellen, um unsere Datenbank zu verbinden, lässt db. js auf einem Ordner namens Datenbank aufrufen",
    "apig.text7": "Machen wir unser Modell für unsere Datenbank",
    "apig.text8": "Lassen Sie uns das Dokument für unser Datenbankmodell erstellen, lassen Sie named nameofclass. js auf einem Ordner namens model.",
    "apig.text9": "So sollte unser Verzeichnis aussehen:",
    "bweb.text1": "Hier zeige ich, wie man einen einfachen Webcrapper erstellt, um Informationen von einer bestimmten YouTube-Kanal-URL zu sammeln, und zwar mit Hilfe von: NodeJs, Puppeteer, Express und Typorm für die Datenbank Mysql. Lassen Sie uns Schritt für Schritt beginnen!",
    "bweb.text2": "*Node muss zuerst installiert werden*. Wir werden ein Paket schnüren müssen. Json so auf der Konsole in unserem Ordnerort, wir tippen 'npm init', wir füllen die Informationen wie gewünscht und das war's.",
    "bweb.text3": "Auf der gleichen Konsole installieren wir Express: npm install express --save . Dann installieren wir Body Parser: npm installieren body-parser . Und für die letzte Installation haben wir den Typorm zur Arbeit mit der Datenbank: npm install typeorm --save.",
    "bweb.text4": "Zuerst machen wir den Scraper, Sie können die Datei scrapper. js aufrufen",
    "bweb.text5": "Lassen Sie uns das Dokument für unsere Datenbank erstellen, das die von uns gesammelten Informationen erhalten wird, nennen wir es db.js",
    "bweb.text6": "Lassen Sie uns nun unsere index. js erstellen, wo wir die Beschaffung und Veröffentlichung unserer Scrapper- und Oue-Datenbank verwalten werden. Wir fügen Folgendes hinzu: `Beispielapplikation, die auf http://localhost:${{{ '{' {}}}port{{{ '}'' }}}` auf der letzten console.log lauscht",
    "bweb.text7": "Nun erstellen wir unsere html mit den letzten Details unseres JS und einigen CSS",
    "bweb.text8": "And thats how we create a basic webscrapper with NodeJs",
    "cal.text1": "Rechner ohne Eval-Funktion auf Javascript",
    "cal.text10": "Lassen Sie uns einige Tests hinzufügen, um sicherzustellen, dass es so funktioniert, wie wir es wollen. Nochmals müssen wir folgendes hinzufügen",
    "cal.text11": "Unser CSS",
    "cal.text12": "Unser Html",
    "cal.text2": "Beispiel 2*(2+2) verwenden Sie * in der Eingabe vor Klammern, um richtig zu arbeiten.",
    "cal.text3": "Lassen Sie uns erklären, wie dies funktioniert",
    "cal.text4": "Lassen Sie uns damit beginnen, einen Konstruktor zu erstellen, der von einer Klasse zur Identifizierung der Operatoren umhüllt ist, die wir für grundlegende Operationen mit den Operationen verwenden werden, die wir machen werden, und wir fügen sein Präfix, Infix und Postfix hinzu, für weitere Informationen über das 'Präfix, Infix und Postfix' klicken Sie",
    "cal.text5": "Hier",
    "cal.text6": "Dann erstellen Sie eine Funktion, um zu definieren, wie die Reihenfolge der Operatoren mit seinem RegEx für die Symbole, die wir verwenden wollen, funktionieren soll.",
    "cal.text7": "Jetzt erstellen wir die Funktionen für die Operatoren, die wir verwenden wollen.",
    "cal.text8": "Wir haben die Funktion geschaffen, die die meiste Arbeit leistet, indem wir den jetzt eingegebenen Wert verarbeiten.",
    "cal.text8a": "*wir müssen bei der Rückkehr folgenden Satz hinzufügen",
    "cal.text9": "Wir schaffen etwas namens",
    "cal.text9a": "singleton",
    "cal.text9b": "zur Behandlung des letzten Teils der Berechnungen und der Erstellung und I/O Handling zur Verwaltung der Ein- und Ausgabe der Ereignisschleife",
    "cal.textTi": "Rechner ohne Bewertung",
    "edu.aca1.text1": "Master in Branded Content und Transmedienkommunikation",
    "edu.aca1.text2": "Universität Carlos III. Madrid. 2015",
    "edu.aca2.text1": "Master in Integriertem Werbemanagement der TWBA.",
    "edu.aca2.text2": "Antonio-Nebrija-Universität. Madrid. 2014",
    "edu.aca3.text1": "Hochschulabschluss in Werbung.",
    "edu.aca3.text2": "UNAPEC. Dominikanische Republik, Santo Domingo. 2012",
    "edu.acatitle": "Akademische Ausbildung",
    "edu.comp1": "Angular: Von Null bis zum Experten, der Anwendungen erstellt (Angular 10+) Udemy Online.",
    "edu.comp2": "Web-Entwicklung Bootcamp Full Stack. 1000 h Factoria F5. Madrid. 2019-2020",
    "edu.comptitle": "Ergänzende Ausbildung",
    "edu.eduexp": "Ausbildung",
    "index.api": "Api Get on Node.JS",
    "index.api2": "Also wurde ich gebeten, eine grundlegende API mit get on Node.JS, entschließe ich mich, die zusätzliche Meile zu machen und sie nach Heroku hochzuladen.",
    "index.cal": "Rechner ohne Bewertung",
    "index.cal2": "Eine ungewöhnliche Anfrage, aber wichtig zu wissen, wie diese mit JS archiviert werden können. Ich wurde gebeten, einen Term-Rechner zu entwickeln, der (), *, /, +, und - verarbeiten kann.",
    "index.con": "Index des Inhalts",
    "index.peter": "Peter meditation",
    "index.peter2": "Ich wurde gebeten, ein effizient gestaltetes Programm zu schreiben, das nach Eingabe einer Zahl zwischen 1 und 10 ^ 18 die zuletzt geprüfte Zahl darstellt. Siehe unten für weitere Informationen dazu.",
    "index.quick": "Kurzanleitung für den Inhalt der Seite",
    "index.webscra": "Basic webscrapper on Node.JS",
    "index.webscra2": "Ein einfacher Webcrapper, hergestellt auf Node. Js",
    "info.contact": " Kontaktinformationen",
    "info.detail": "Dies sind die Möglichkeiten, mich zu kontaktieren.",
    "info.detail1": "Profil auf GitHub",
    "info.detail2": "Profil auf LinkedIn",
    "intro.contact": "Kontakt",
    "intro.ctitle": "Webentwickler | Werbetreibender",
    "intro.description.text1": " Mein Name ist Ernesto Silva Languasco. Ich studierte Werbung als Universitätskarriere mit Schwerpunkt auf Inhaltserstellung und Marketingstrategie.",
    "intro.description.text2": " Ich bin vor einiger Zeit in die Welt der Web-Programmierung eingestiegen, da ich mich schon immer für Technologie und Kommunikation interessiert habe. Das Ergebnis ist diese Seite. Ich strebe an, ein Full Stack-Programmierer zu sein, da es ein guter Ausgleich ist, als Profi einen guten Service bieten zu können und sowohl das Front-End als auch das Back-End zu beherrschen. Dadurch wird sichergestellt, dass bei der Arbeit an einem neuen Projekt die beste Design-, Entwicklungs- und Verbreitungsstrategie unter Berücksichtigung der Instrumente angewandt wird.",
    "intro.home": "Startseite",
    "intro.portfolio": "Geschäftsbereich",
    "intro.subctitle": "Ein Werbefachmann, der in die Webentwicklung einsteigt und immer nach unten scrollt oder Seiten nach links blättert.",
    "job.jobexp": "Berufserfahrung",
    "lan.lan1": "Englisch: C1",
    "lan.lan2": "Deutsch: A2",
    "lan.lan3": "Spanisch: Muttersprache",
    "lan.ltitle": "Sprachen",
    "peter.text1": "Ich wurde gebeten, ein effizient gestaltetes Programm zu schreiben, das nach Eingabe einer Zahl zwischen 1 und 10 ^ 18 die letzte von Peter geprüfte Zahl darstellt und die letzte von Peter aufgeschriebene Zahl ausgibt. Ohne zu jeder Nummer zu gehen, eine nach der anderen.",
    "peter.text1a": "Dies sind die angeführten Beispiele:",
    "peter.text1b": "Beispiele: Eingabe: 23245 Ausgabe: 22999; Eingabe: 11235888 Ausgabe: 11235888; Eingabe: 111110 Ausgabe: 99999",
    "peter.text1c": "der vollständige Ausdruck ist der folgende: let s = `${{ '{ '{' }}}n{{{ '}'' }}}`;",
    "peter.text2": "Handelt es sich um einen einfachen Code, doch die Art und Weise, wie er präsentiert wird, lässt ihn komplizierter aussehen.",
    "recent1.jobdes": "Vollzeit-Praktikant, der auf der derzeitigen Parkplattform sowohl im Front- als auch im Backend arbeitet",
    "recent2.jobdes.text1": "-Koordination eines Teams von drei Personen in den Abteilungen Marketing und Wartung",
    "recent2.jobdes.text2": "-Kontakt mit Immobilienverwaltungsplattformen, Kundenkontakt, Platzierung von Immobilien in digitalen Medien, kollaborative Coworking-Strategien, Teamkoordination, Grafikdesign, Optimierung des Immobilienzustands, Notfallmanagement, Kontakt mit Auftragnehmern für Verbesserungen.",
    "recent3.jobdes": "Schaffung von Kunst für die verschiedenen Bars und Restaurants, die das Unternehmen besitzt.",
    "recent4.jobdes.text1": "-Inhaltserstellung, SEO und SEM auf Unternehmenswebsites.",
    "recent4.jobdes.text2": "-Inhaltserstellung, SEO und SEM auf Unternehmenswebsites.",
    "tec.tecexp": "Technische Fähigkeiten",
    "work.port": "Hier können Sie die Projekte durchsuchen, mit denen ich gearbeitet habe. Sie werden in ihrer Originalsprache veröffentlicht."
}