{
	"Unethical.intro": "In this section of my portfolio I will be posting most of the tests I have been asked during the job hiring process. The goal is to show how i resolve some test with the pass of time i will be uploading the ones who works for the test and explaining the code for anyone who wants to understand how it works.Feel free to grab it and used it to any jobtest similar to theses ones here.",
	"apig.text1": "A basic API with Get method made on NodeJs, ExpressJS and Moongose (MongoDB)",
	"apig.text10": "For deployment we use Heroku and with the following",
	"apig.text10a": "Guide",
	"apig.text10b": ",its just adding on Config Vars MONGOD_URI and out deb link from Mongo and that's basically all we can see the Jason info on /list we can add that url on any connection and we can see the information, as an extra you can see the CRUD methods are included you can test with Postman ",
	"apig.text2": "So....I was asked to make a simple API Get to show information from a Nosql database in this case MongoDB",
	"apig.text3": "We need to install Nodejs (if you don't have it), ExpressJS, Body Parse, mongoose and dotenv, this last one is for enabling an easy deployment. ",
	"apig.text4": "First, we make a package.Json then we create a file called app.Js, the name can change it doesn't matter.",
	"apig.text5": "Now lets create our database file, lets call it db.js",
	"apig.text6": "Lets create the document to connect our database , lets call db.js on a folder called database",
	"apig.text7": "Lets make our Model for our database ",
	"apig.text8": "Lets create the document for our database model, lets called nameofclass.js on a folder called model.",
	"apig.text9": "Our directory should look like this: ",
	"bweb.text1": "Here I will show how to create a basic webscrapper to gather information from a given YouTube channel url, using: NodeJs, Puppeteer, Express and typeorm for the database Mysql. Step by step lets begin! ",
	"bweb.text2": "*Node must be installed first*. We will need to create a package.Json so on the console in our folder location, we type 'npm init', we fill the info as we desire and that's it. ",
	"bweb.text3": "On the same console we install Express: npm install express --save . Then we install Body Parser: npm install body-parser . And for last install we the typeorm to work with database: npm install typeorm --save. ",
	"bweb.text4": "First lets make the scraper, you can call the file scrapper.js ",
	"bweb.text5": "Lets create the document for our database which is going to recive the info we grab, let's call it db.js  ",
	"bweb.text6": "Now lets create our index.js were we are going to manage the get and post of our scrapper and oue database. We add this: `Example app listening at http://localhost:${{ '{' }}port{{ '}' }}` on the last console.log",
	"bweb.text7": "Now we create our html with the final details of our JS and some CSS",
	"bweb.text8": "And thats how we create a basic webscrapper with NodeJs ",
	"cal.text1": "Calculator without Eval function on javascript ",
	"cal.text10": "Lets add some test to make sure it works the way we want. Again we need to add this",
	"cal.text11": "Our CSS",
	"cal.text12": "Our Html",
	"cal.text2": "Example 2*(2+2) use * in input before parentheses in order to work properly.",
	"cal.text3": "Lets explain how does this work",
	"cal.text4": "Lets start by creating a constructor wrapped by a class for identifing the operators, we are going to use for basics operations with the operations is going to make and we add his prefix, infix and postfix,  for more information about the 'prefix, infix and postfix' click ",
	"cal.text5": "here",
	"cal.text6": "Then create a function to define how the order of operators are going to work with his RegEx for the symbols we want to use.",
	"cal.text7": "Now we create the functions for the operators we want to use.",
	"cal.text8": "We procced to create the function that does most of the work by proccesing the value inputed now ",
	"cal.text8a": "*we need to add the following sentence on the return ",
	"cal.text9": "We create something called",
	"cal.text9a": "singleton",
	"cal.text9b": "to handle the last part of calculations and create and I/O Handling to manage the event loop input and output",
	"cal.textTi": "Calculator without eval",
	"edu.aca1.text1": "Master in Branded Content and Transmedia Communication.",
	"edu.aca1.text2": "University Carlos III. Madrid. 2015",
	"edu.aca2.text1": "Master in Integrated Advertising Management by TWBA.",
	"edu.aca2.text2": "University Antonio Nebrija. Madrid. 2014",
	"edu.aca3.text1": "Degree in advertising.",
	"edu.aca3.text2": "UNAPEC. Rep. Dominicana, Santo Domingo. 2012",
	"edu.acatitle": "Academic Training",
	"edu.comp1": "Angular: From zero to expert creating applications (Angular 10+) Udemy Online.",
	"edu.comp2": "Web Development Bootcamp Full Stack. 1000 h Factoria F5. Madrid.",
	"edu.comp3": "Web development for electronic commerce (E-Commerce/Electronic Commerce). Academia Colon",
	"edu.comp4": "Programming with object-oriented languages and relational databases. SEPE",
	"edu.comp5": "Node.JS: From zero to expert. Udemy",
	"edu.comptitle": "Complementary Training",
	"edu.eduexp": "Academic",
	"hola.title": "Hi!",
	"index.api": "Api Get on Node.JS",
	"index.api2": "So i was asked to make a basic API with get on Node.JS, I decide to make the extra mile and upload it to Heroku.",
	"index.cal": "Calculator without eval",
	"index.cal2": "An unusual request but important to know how to archived these with JS. I was asked to develop a term calculator that can handle (), *, /, +, and -.",
	"index.con": "Index of the content",
	"index.peter": "Peter meditation",
	"index.peter2": "I was asked to write an efficiently designed program which, after entering a number between 1 and 10 ^ 18, represents the last number checked. See below for more information about it.",
	"index.quick": "Quick guide of the contents of the page",
	"index.webscra": "Basic webscrapper on Node.JS",
	"index.webscra2": "A basic webscrapper made on NodeJs",
	"info.contact": "Contact information",
	"info.detail": "These are the means to contact me.",
	"info.detail1": "Profile on GitHub",
	"info.detail2": "Profile on LinkedIn",
	"intro.contact": "Contact",
	"intro.ctitle": "Web Developer | Advertiser",
	"intro.description.text1": " Hello, my name is Ernesto Silva Languasco an advertsing major with a passion on web development. After been in the advertsing world for almost 5 years, I develop a passion for the world of web development and as a consequence of that decided to change my carrier pass. ",
	"intro.description.text2": " As a result, I have been a freelance on the area for 2 years now, and develop this web site inspire by a full stack programmer. You will find everything you need to know about me included my portfolio is both Front-End and Back-End programming. Hope you enjoy!",
	"intro.home": "Home",
	"intro.portfolio": "Portfolio",
	"intro.subctitle": "An advertising professional who moves into web development, always scrolling down or turning pages to the left.",
	"job.jobexp": "Work Experience",
	"lan.lan1": "English: C1",
	"lan.lan2": "German: A2",
	"lan.lan3": "Spanish: Native",
	"lan.ltitle": "Languages",
	"peter.text1": "I was asked to write an efficiently designed program which, after entering a number between 1 and 10 ^ 18, represents the last number checked by Peter, outputs the last number written down by Peter. Without going to each number, one by one.",
	"peter.text1a": "These are the examples given: ",
	"peter.text1b": "Examples: Input: 23245 Output: 22999; Input: 11235888 Output: 11235888; Input: 111110 Output: 99999",
	"peter.text1c": "the full expresion is the following: let s = `${{ '{' }}n{{ '}' }}`;",
	"peter.text2": "Is a simple code yet the way is presented make it look more complicated.",
	"recent1.jobdes": "Intern full-time, working on the current platform of car parks both front and back end.",
	"recent2.jobdes.text1": "-Coordination of a team of three people in the marketing and maintenance departments.",
	"recent2.jobdes.text2": "-Contact with real estate management platforms, contact with clients, location of real estate in digital media, coworking collaboration strategies, team coordination, graphic design, optimization of the condition of real estate, emergency management, contact with contractors for improvements or repair.",
	"recent3.jobdes": "Creation of arts for the different bars and restaurants that the company owns.",
	"recent4.jobdes.text1": "-Content creation, SEO and SEM on company websites.",
	"recent4.jobdes.text2": "-Newsletter design and Google Analytics",
	"recentF.jobdes": "Freelancer in web development and advertising content creation, strategy and user experience.",
	"tec.tecexp": "Technical Skills",
	"work.port": "Here you can browse the projects I have worked with. They are posted in their original language"
}