{
	"hola.title": "Hi!",
	"edu.aca1.text1": "Master in Branded Content and Transmedia Communication.",
	"edu.aca1.text2": "University Carlos III. Madrid. 2015",
	"edu.aca2.text1": "Master in Integrated Advertising Management by TWBA.",
	"edu.aca2.text2": "University Antonio Nebrija. Madrid. 2014",
	"edu.aca3.text1": "Degree in advertising.",
	"edu.aca3.text2": "UNAPEC. Rep. Dominicana, Santo Domingo. 2012",
	"edu.acatitle": "Academic Training",
	"edu.comp1": "Angular: From zero to expert creating applications (Angular 10+) Udemy Online. ",
	"edu.comp2": "Web Development Bootcamp Full Stack. 1000 h Factoria F5. Madrid. 2019-2020",
	"edu.comptitle": "Complementary Training",
	"edu.eduexp": "Academic",
	"info.contact": "Contact information",
	"info.detail": "These are the means to contact me.",
	"info.detail1": "Profile on GitHub",
	"info.detail2": "Profile on LinkedIn",
	"intro.contact": "Contact",
	"intro.ctitle": "Web Developer | Advertiser",
	"intro.description.text1": " My name is Ernesto Silva Languasco. I studied advertising as a university career focused on content creation and marketing strategy.",
	"intro.description.text2": " I entered the world of web development some time ago, as I have always liked technology and communication. The result is this page. I aspire to be a Full Stack programmer, since it is a good balance to be able to offer a good service as a professional and also to be able to handle both the Front-End and the Back-End. This ensures that when working on a new project, the best design, development and dissemination strategy is applied, taking into account the tools.",
	"intro.home": "Home",
	"intro.portfolio": "Portfolio",
	"intro.subctitle": "An advertising professional who moves into web development, always scrolling down or turning pages to the left.",
	"job.jobexp": "Work Experience",
	"lan.lan1": "English: C1",
	"lan.lan2": "German: A2",
	"lan.lan3": "Spanish: Native",
	"lan.ltitle": "Languages",
	"recent1.jobdes": "Intern full-time, working on the current platform of car parks both front and back end.",
	"recent2.jobdes.text1": "-Coordination of a team of three people in the marketing and maintenance departments.",
	"recent2.jobdes.text2": "-Contact with real estate management platforms, contact with clients, location of real estate in digital media, coworking collaboration strategies, team coordination, graphic design, optimization of the condition of real estate, emergency management, contact with contractors for improvements or repair.",
	"recent3.jobdes": "Creation of arts for the different bars and restaurants that the company owns.",
	"recent4.jobdes.text1": "-Content creation, SEO and SEM on company websites.",
	"recent4.jobdes.text2": "-Newsletter design and Google Analytics",
	"tec.tecexp": "Technical Skills",
	"work.port": "Here you can browse the projects I have worked with. They are posted in their original language"
}